In [41]:
import numpy as np
import pandas as pd

# Pandas Dataframes

In [42]:
# Creating Dataframe type1 dict+list
d1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'London', 'Paris']
}

In [43]:
pdf1 = pd.DataFrame(d1)

In [44]:
pdf1

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [45]:
# Creating DF type 2 dict+dict
d2={
    "sale":{ "name":"jacob","age":34,"salary":200000},
    "Marketing":{"name":"jaggu","age":36,"salary":300000}
}

In [46]:
pdf2 = pd.DataFrame(d2)

In [47]:
pdf2

          sale Marketing
name     jacob     jaggu
age         34        36
salary  200000    300000

In [48]:
pdf2.index #pdf2 has label index, label means it is not integer

Index(['name', 'age', 'salary'], dtype='object')

In [49]:
pdf1.index  # pdf 1 has numbered index

RangeIndex(start=0, stop=3, step=1)

In [50]:
pdf2['sale'][0]

'jacob'

In [51]:
pdf2['sale']['name']

'jacob'

In [52]:
pdf1['City'][1]

'London'

In [53]:
# type 3 creation of DF list->list
l1 = [
    [2,5,4],
    [3,5,6],
    [8,6,9]
]

In [54]:
pdf3 = pd.DataFrame(l1,index=['row1','row2','row3'])

In [55]:
# Type 4 Creating DF with column names
pdf4 = pd.DataFrame(l1,columns=['A','B','C'],index=['row1','row2','row3'])

In [56]:
pdf3

      0  1  2
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [57]:
pdf4

      A  B  C
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [58]:
d3 = {'ip':[25,10,34],
      'math':[5,34,14],
      'english':[6,15,38]

}

In [59]:
pdf5 = pd.DataFrame(d3)

In [60]:
pdf5

   ip  math  english
0  25     5        6
1  10    34       15
2  34    14       38

In [61]:
pdf5['math'][1]

34

In [62]:
d4 = {
    "sub":{"math":23,"eng":15,"ip":26},
    "topstu":{"math":"ria","eng":"sia","ip":"mia"}

}

In [63]:
pdf6 = pd.DataFrame(d4)

In [64]:
pdf6

      sub topstu
math   23    ria
eng    15    sia
ip     26    mia

In [65]:
pdf6["sub"]["eng"]

15

In [66]:
l2 = [
    [6,8,3],
    [2,8,4],
    ["a","b","c"]
]

In [67]:
pdf7 = pd.DataFrame(l2,index=["x","y","z"])

In [68]:
pdf7

   0  1  2
x  6  8  3
y  2  8  4
z  a  b  c

In [69]:
pdf8 = pd.DataFrame(l2,columns=["p","q","r"],index=["z","y","x"])

In [70]:
pdf8

   p  q  r
z  6  8  3
y  2  8  4
x  a  b  c

In [71]:
pdf8["q"]["x"]

'b'

In [72]:
pdf8.index

Index(['z', 'y', 'x'], dtype='object')

In [73]:
pseries1 = pd.Series(range(2,7,1))

In [74]:
pseries1

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [75]:
pseries2 = pd.Series(range(5,50,6))

In [76]:
d6 ={
    "jj":pseries1,
    "tomson":pseries2
}

In [77]:
pdf9 = pd.DataFrame(d6)

In [78]:
pdf9

    jj  tomson
0  2.0       5
1  3.0      11
2  4.0      17
3  5.0      23
4  6.0      29
5  NaN      35
6  NaN      41
7  NaN      47

In [79]:
pdf10 = pd.DataFrame(pdf9)

### Attr of Dataframe
-index   
-axes   
-dtype   
-shape    
-size    
-value   
-ndim   
-T

In [80]:
pdf3.index

Index(['row1', 'row2', 'row3'], dtype='object')

In [81]:
pdf3.axes

[Index(['row1', 'row2', 'row3'], dtype='object'),
 RangeIndex(start=0, stop=3, step=1)]

In [82]:
pdf3.columns

RangeIndex(start=0, stop=3, step=1)

In [83]:
pdf6.values

array([[23, 'ria'],
       [15, 'sia'],
       [26, 'mia']], dtype=object)

In [85]:
pdf6.dtypes

sub        int64
topstu    object
dtype: object

In [86]:
pdf6.shape

(3, 2)

In [87]:
pdf6

      sub topstu
math   23    ria
eng    15    sia
ip     26    mia

In [93]:
pdf3.T

   row1  row2  row3
0     2     3     8
1     5     5     6
2     4     6     9

In [94]:
pdf3.T

   row1  row2  row3
0     2     3     8
1     5     5     6
2     4     6     9

### some DF methods

In [ ]:
pdf1.count() #by default axis=0

Name    3
Age     3
City    3
dtype: int64

In [96]:
pdf1.count(axis=1)

0    3
1    3
2    3
dtype: int64

### Data access in pandas

In [97]:
pdf1

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris

In [ ]:
pdf1['Age']   # Column first approch for data accessing

0    25
1    30
2    35
Name: Age, dtype: int64

In [99]:
pdf1['Age'][1]

30

In [ ]:
pdf1[['Age','Name']]  # Multiple coloumn access

   Age     Name
0   25    Alice
1   30      Bob
2   35  Charlie

In [104]:
pdf4

      A  B  C
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [105]:
pdf4["B"]

row1    5
row2    5
row3    6
Name: B, dtype: int64

In [108]:
pdf4[["B","C"]]

      B  C
row1  5  4
row2  5  6
row3  6  9

In [109]:
pdf4[["A","B"]]

      A  B
row1  2  5
row2  3  5
row3  8  6

### using Dataframe.loc method for sub DF    
DF.loc[startrow:endrow,startcol:endcol]

In [110]:
pdf4.loc['row1':'row2',"B":"C"]

      B  C
row1  5  4
row2  5  6

In [111]:
pdf4

      A  B  C
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [112]:
pdf4.loc["row2":"row3","A":"B"]

      A  B
row2  3  5
row3  8  6

In [114]:
pdf4.loc["row1":"row2","A":"C"]

      A  B  C
row1  2  5  4
row2  3  5  6

In [ ]:
pdf4.loc["row1":"row2",:]  # all column selected row

      A  B  C
row1  2  5  4
row2  3  5  6

In [ ]:
pdf4.loc[:,"B":"C"] # all row selected columns

      B  C
row1  5  4
row2  5  6
row3  6  9

In [120]:
pdf3

      0  1  2
row1  2  5  4
row2  3  5  6
row3  8  6  9

### Use of .iloc aka indexlocator         
df.iloc[startrowindex:endrowindex,startcolumnindex:endcolumnindex]

In [125]:
pdf3.iloc[0:3,0:3]

      0  1  2
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [126]:
pdf3.iloc[0:2,0:2]

      0  1
row1  2  5
row2  3  5

In [127]:
pdf3.iloc[:,0:2]

      0  1
row1  2  5
row2  3  5
row3  8  6

In [128]:
pdf3.iloc[0:2,:]

      0  1  2
row1  2  5  4
row2  3  5  6

### Adding/Deleting/Modifying data in DF    
- .loc   
- .iloc    
- .at

In [130]:
pdf3

      0  1  2
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [132]:
pdf3["newcol"] =23

In [133]:
pdf3

      0  1  2  newcol
row1  2  5  4      23
row2  3  5  6      23
row3  8  6  9      23

In [ ]:
pdf3["newcol2"] = [7,8,9]  #adding a new coloumn

In [135]:
pdf3

      0  1  2  newcol  newcol2
row1  2  5  4      23        7
row2  3  5  6      23        8
row3  8  6  9      23        9

In [ ]:
pdf3["newcol"] = [3,4,5]   # modification on coloumn

In [139]:
pdf2

          sale Marketing  newcol
name     jacob     jaggu       3
age         34        36       4
salary  200000    300000       5

In [138]:
pdf3

      0  1  2  newcol  newcol2
row1  2  5  4       3        7
row2  3  5  6       4        8
row3  8  6  9       5        9

In [140]:
pdf2["newcol1"]=["battrang",55,20]

In [141]:
pdf2

          sale Marketing  newcol   newcol1
name     jacob     jaggu       3  battrang
age         34        36       4        55
salary  200000    300000       5        20

In [143]:
pdf2["newcol1"]["salary"]=500000

/var/folders/0z/nf0mgd616t57jd2kcs_168kc0000gn/T/ipykernel_8585/3892642431.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pdf2["newcol1"]["salary"]=500000

In [145]:
pdf2.loc["salary":"salary","newcol1":"newcol1"]

       newcol1
salary  500000

In [146]:
pdf2

          sale Marketing  newcol   newcol1
name     jacob     jaggu       3  battrang
age         34        36       4        55
salary  200000    300000       5    500000

In [ ]:
del pdf2['newcol'] #Deleting coloumn

In [148]:
pdf2

          sale Marketing   newcol1
name     jacob     jaggu  battrang
age         34        36        55
salary  200000    300000    500000

In [149]:
pdf5

   ip  math  english
0  25     5        6
1  10    34       15
2  34    14       38

In [151]:
pdf8

   p  q  r
z  6  8  3
y  2  8  4
x  a  b  c

In [154]:
del pdf8[['q'],['r']]

InvalidIndexError: (['q'], ['r'])

In [156]:
pdf8.drop(['q','r'],axis=1)

   p
z  6
y  2
x  a

In [157]:
pdf8.drop(["y","z"],axis=0)

   p  q  r
x  a  b  c

In [158]:
pdf2

          sale Marketing   newcol1
name     jacob     jaggu  battrang
age         34        36        55
salary  200000    300000    500000

In [ ]:
pdf2.rename(columns={"newcol1":"batar"})   #coloumn rename

          sale Marketing     batar
name     jacob     jaggu  battrang
age         34        36        55
salary  200000    300000    500000

In [ ]:
pdf2.rename(columns={"newcol1":"batar"},inplace=True)  # use of inplace

In [162]:
pdf2

          sale Marketing     batar
name     jacob     jaggu  battrang
age         34        36        55
salary  200000    300000    500000

In [164]:
pdf2.rename(index={"name":"firstname"})

             sale Marketing     batar
firstname   jacob     jaggu  battrang
age            34        36        55
salary     200000    300000    500000

In [165]:
pdf2

          sale Marketing     batar
name     jacob     jaggu  battrang
age         34        36        55
salary  200000    300000    500000

In [166]:
pdf2.rename(index={"name":"firstname"},inplace=True)

In [167]:
pdf2

             sale Marketing     batar
firstname   jacob     jaggu  battrang
age            34        36        55
salary     200000    300000    500000

In [168]:
pdf2.rename(index={"salary":"SALARY"},columns={"batar":"BUTER"})

             sale Marketing     BUTER
firstname   jacob     jaggu  battrang
age            34        36        55
SALARY     200000    300000    500000

In [169]:
pdf2

             sale Marketing     batar
firstname   jacob     jaggu  battrang
age            34        36        55
salary     200000    300000    500000

In [170]:
pdf2.rename(index={"salary":"SALARY"},columns={"batar":"BUTER"},inplace=True)

In [171]:
pdf2

             sale Marketing     BUTER
firstname   jacob     jaggu  battrang
age            34        36        55
SALARY     200000    300000    500000

## df.iterrows() and df.itercolumns()

In [172]:
data11 = {
  "firstname": ["Sally", "Mary", "John"],
  "age": [50, 40, 30]
}

In [173]:


df11 = pd.DataFrame(data11)

In [174]:
df11

  firstname  age
0     Sally   50
1      Mary   40
2      John   30

In [177]:


for (indexrow, rowSeries) in df11.iterrows():
  print("The index is  -: ",indexrow)
  print(rowSeries["firstname"])
  print(rowSeries["age"])

The index is  -:  0
Sally
50
The index is  -:  1
Mary
40
The index is  -:  2
John
30

In [181]:
pdf4

      A  B  C
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [180]:

for (indexcol, colSeries) in df11.items():
  print("The index is  -: ",indexcol)
  print(colSeries)
  #print(colSeries["firstname"])
  #print(colSeries["age"])

The index is  -:  firstname
0    Sally
1     Mary
2     John
Name: firstname, dtype: object
The index is  -:  age
0    50
1    40
2    30
Name: age, dtype: int64

In [182]:

pdf4

      A  B  C
row1  2  5  4
row2  3  5  6
row3  8  6  9

In [183]:
for (rindex,rseries) in pdf4.iterrows():
    print("the rindex value is ",rindex)
    print(rseries)

the rindex value is  row1
A    2
B    5
C    4
Name: row1, dtype: int64
the rindex value is  row2
A    3
B    5
C    6
Name: row2, dtype: int64
the rindex value is  row3
A    8
B    6
C    9
Name: row3, dtype: int64

In [185]:
for (cindex,cseries) in pdf4.items():
    print("the cindex value is ",cindex)
    print(cseries)

the cindex value is  A
row1    2
row2    3
row3    8
Name: A, dtype: int64
the cindex value is  B
row1    5
row2    5
row3    6
Name: B, dtype: int64
the cindex value is  C
row1    4
row2    6
row3    9
Name: C, dtype: int64